app/controllers/reviews_controller.rb

    def create
        review = Review.create(review_params)
---
INSERT INTO "reviews" ("title", "date_posted", "review_text", "user_id", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"