app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
    def index
        schools = School.all

INSERT INTO "schools" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ABC School"], ["created_at", "2022-08-19 18:46:01.954676"], ["updated_at", "2022-08-19 18:46:01.954676"]]
---
    def create
        school = School.create(school_params)